In [1]:
import pandas as pd

In [7]:
'''Series – like a column in Excel

It’s a single list of data with an index.
'''
df= pd.Series([10,20,30,40])
print(df)
print(type(df))
df=pd.DataFrame(df)
print(df)
print(type(df))

0    10
1    20
2    30
3    40
dtype: int64
<class 'pandas.core.series.Series'>
    0
0  10
1  20
2  30
3  40
<class 'pandas.core.frame.DataFrame'>

In [10]:
data ={ 
    'Name' : ['Alice', 'Bob', 'Charlie'],
    'Age' : [ 25,30,35],
    'City':['NY','LA','Chicago']
}

In [13]:
print(type(data))
print(data)

<class 'dict'>
{'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['NY', 'LA', 'Chicago']}

In [14]:
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago
<class 'pandas.core.frame.DataFrame'>

In [17]:
#series
s=df['Name']
print(type(s)) #give series 
s=df[['Name']]
print(type(s)) # gives DataFrame

<class 'pandas.core.frame.DataFrame'>

In [18]:
df['Age']

0    25
1    30
2    35
Name: Age, dtype: int64

In [20]:
df[['Age','City']]

   Age     City
0   25       NY
1   30       LA
2   35  Chicago

In [44]:
#Filter rows (like SQL WHERE):
s=df['Age'] >28

print(df[s])
s=pd.Series([False,False,True])

print(df[s])

s=pd.Series([False,False,True,True])
print(df[s])

      Name  Age     City
1      Bob   30       LA
2  Charlie   35  Chicago
      Name  Age     City
2  Charlie   35  Chicago

<ipython-input-44-4ce81a638dd0>:11: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  print(df[s])

      Name  Age     City
2  Charlie   35  Chicago

In [49]:
df[df['Age']>28]

      Name  Age     City
1      Bob   30       LA
2  Charlie   35  Chicago

In [56]:
df[df['Name']=='Bob']
df.loc[df['Name']!='Bob']

      Name  Age     City
0    Alice   25       NY
2  Charlie   35  Chicago

In [60]:
df.loc[(df['Name']!='Bob'),['Name','Age']]# For Loc - first value is filter , other values are column names

      Name  Age
0    Alice   25
2  Charlie   35

In [96]:
#multiple conditon  -with logical operators (&,|,~)

df

df[ ~(df['Name']=='Bob') & (df['Age']<=30) |(df['City']=='Ny')]

    Name  Age City
0  Alice   25   NY

In [204]:
age_filter= [20,23,24,25,30]
df_Filter=df[df['Age'].isin(age_filter)]
city=['TX','LA','NY']
df_Filter2=df_Filter[df_Filter['City'].isin(city)]
df_Filter2

           Email  level_0  index   Name  Age City
0  sai@gmail.com        0      2    Bob   30   LA
1  sai@gmail.com        1      1  Alice   25   NY

In [199]:
df['Age]

<class 'SyntaxError'>: unterminated string literal (detected at line 1) (<ipython-input-199-625d7ac5204d>, line 1)

In [ ]:
#df.loc[<row_condition>, <columns_to_return>].sort_values(by=<column>, ascending=<True/False>)

In [101]:
df.loc[~(df['Name']=='Bob'),['Name','Age']].sort_values(by='Age',ascending= False)

      Name  Age
2  Charlie   35
0    Alice   25

In [106]:
df.iloc[0,[1,2]]

Age     25
City    NY
Name: 0, dtype: object

In [108]:
df

      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago

In [119]:
df.loc[[0,1], ['Name','Age']]

    Name  Age
0  Alice   25
1    Bob   30

In [121]:
df.loc[:, ['Name','Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [146]:
df.loc[0:2,['Name','City']]
df.iloc[:,0:2]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [136]:
df.col

Index(['Name', 'Age', 'City'], dtype='object')

In [129]:
df.shape

(3, 3)

In [118]:
df['Age'].value_counts()

Age
25    1
30    1
35    1
Name: count, dtype: int64

In [147]:
df.index.is_unique

True

In [148]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [149]:
df['Email']=[ 'sai@gmail.com','sai@gmail.com','Charan@gmail.com']

In [175]:
df

                  index     Name  Age     City
Email
sai@gmail.com         2      Bob   30       LA
sai@gmail.com         1    Alice   25       NY
Charan@gmail.com      0  Charlie   35  Chicago

In [185]:
df.set_index('Email',inplace=True)

In [179]:
df.index

Index(['sai@gmail.com', 'sai@gmail.com', 'Charan@gmail.com'], dtype='object', name='Email')

In [180]:
df.sort_index(ascending=False, inplace=True)
df

                  index     Name  Age     City
Email
sai@gmail.com         2      Bob   30       LA
sai@gmail.com         1    Alice   25       NY
Charan@gmail.com      0  Charlie   35  Chicago

In [186]:
df.reset_index(inplace=True)

In [187]:
df

              Email  level_0  index     Name  Age     City
0     sai@gmail.com        0      2      Bob   30       LA
1     sai@gmail.com        1      1    Alice   25       NY
2  Charan@gmail.com        2      0  Charlie   35  Chicago

In [ ]:
#Updatinng rows-cols